MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx174f256d.h
#define _CNENC_CNIEC9_POSITION                   0x00000009
#define _CNENC_CNIEC9_MASK                       0x00000200
#define _CNENC_CNIEC9_LENGTH                     0x00000001

#define _CNENC_w_POSITION                        0x00000000
#define _CNENC_w_MASK                            0xFFFFFFFF
#define _CNENC_w_LENGTH                          0x00000020

#define _CNSTATC_CNSTATC0_POSITION               0x00000000
#define _CNSTATC_CNSTATC0_MASK                   0x00000001
#define _CNSTATC_CNSTATC0_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC1_POSITION               0x00000001
#define _CNSTATC_CNSTATC1_MASK                   0x00000002
#define _CNSTATC_CNSTATC1_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC2_POSITION               0x00000002
#define _CNSTATC_CNSTATC2_MASK                   0x00000004
#define _CNSTATC_CNSTATC2_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC3_POSITION               0x00000003
#define _CNSTATC_CNSTATC3_MASK                   0x00000008
#define _CNSTATC_CNSTATC3_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC4_POSITION               0x00000004
#define _CNSTATC_CNSTATC4_MASK                   0x00000010
#define _CNSTATC_CNSTATC4_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC5_POSITION               0x00000005
#define _CNSTATC_CNSTATC5_MASK                   0x00000020
#define _CNSTATC_CNSTATC5_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC6_POSITION               0x00000006
#define _CNSTATC_CNSTATC6_MASK                   0x00000040
#define _CNSTATC_CNSTATC6_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC7_POSITION               0x00000007
#define _CNSTATC_CNSTATC7_MASK                   0x00000080
#define _CNSTATC_CNSTATC7_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC8_POSITION               0x00000008
#define _CNSTATC_CNSTATC8_MASK                   0x00000100
#define _CNSTATC_CNSTATC8_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC9_POSITION               0x00000009
#define _CNSTATC_CNSTATC9_MASK                   0x00000200
#define _CNSTATC_CNSTATC9_LENGTH                 0x00000001

#define _CNSTATC_w_POSITION                      0x00000000
#define _CNSTATC_w_MASK                          0xFFFFFFFF
#define _CNSTATC_w_LENGTH                        0x00000020

#define _DEVCFG3_USERID_POSITION                 0x00000000
#define _DEVCFG3_USERID_MASK                     0x0000FFFF
#define _DEVCFG3_USERID_LENGTH                   0x00000010

#define _DEVCFG3_AI2C1_POSITION                  0x00000016
#define _DEVCFG3_AI2C1_MASK                      0x00400000
#define _DEVCFG3_AI2C1_LENGTH                    0x00000001

#define _DEVCFG3_AI2C2_POSITION                  0x00000017
#define _DEVCFG3_AI2C2_MASK                      0x00800000
#define _DEVCFG3_AI2C2_LENGTH                    0x00000001

#define _DEVCFG3_PMDL1WAY_POSITION               0x0000001C
#define _DEVCFG3_PMDL1WAY_MASK                   0x10000000
#define _DEVCFG3_PMDL1WAY_LENGTH                 0x00000001

#define _DEVCFG3_IOL1WAY_POSITION                0x0000001D
#define _DEVCFG3_IOL1WAY_MASK                    0x20000000
#define _DEVCFG3_IOL1WAY_LENGTH                  0x00000001

#define _DEVCFG3_w_POSITION                      0x00000000
#define _DEVCFG3_w_MASK                          0xFFFFFFFF
#define _DEVCFG3_w_LENGTH                        0x00000020

#define _DEVCFG2_FPLLIDIV_POSITION               0x00000000
#define _DEVCFG2_FPLLIDIV_MASK                   0x00000007
#define _DEVCFG2_FPLLIDIV_LENGTH                 0x00000003

#define _DEVCFG2_FPLLMUL_POSITION                0x00000004
#define _DEVCFG2_FPLLMUL_MASK                    0x00000070
#define _DEVCFG2_FPLLMUL_LENGTH                  0x00000003

#define _DEVCFG2_FPLLICLK_POSITION               0x00000007
#define _DEVCFG2_FPLLICLK_MASK                   0x00000080
#define _DEVCFG2_FPLLICLK_LENGTH                 0x00000001

#define _DEVCFG2_FPLLODIV_POSITION               0x00000010
#define _DEVCFG2_FPLLODIV_MASK                   0x00070000
#define _DEVCFG2_FPLLODIV_LENGTH                 0x00000003

#define _DEVCFG2_BOREN_POSITION                  0x00000014
#define _DEVCFG2_BOREN_MASK                      0x00100000
#define _DEVCFG2_BOREN_LENGTH                    0x00000001

#define _DEVCFG2_DSBOREN_POSITION                0x00000017
#define _DEVCFG2_DSBOREN_MASK                    0x00800000
#define _DEVCFG2_DSBOREN_LENGTH                  0x00000001

#define _DEVCFG2_DSWDTPS_POSITION                0x00000018
#define _DEVCFG2_DSWDTPS_MASK                    0x1F000000
#define _DEVCFG2_DSWDTPS_LENGTH                  0x00000005

#define _DEVCFG2_DSWDTOSC_POSITION               0x0000001D
#define _DEVCFG2_DSWDTOSC_MASK                   0x20000000
#define _DEVCFG2_DSWDTOSC_LENGTH                 0x00000001

#define _DEVCFG2_DSWDTEN_POSITION                0x0000001E
#define _DEVCFG2_DSWDTEN_MASK                    0x40000000
#define _DEVCFG2_DSWDTEN_LENGTH                  0x00000001

#define _DEVCFG2_FDSEN_POSITION                  0x0000001F
#define _DEVCFG2_FDSEN_MASK                      0x80000000
#define _DEVCFG2_FDSEN_LENGTH                    0x00000001

#define _DEVCFG2_w_POSITION                      0x00000000
#define _DEVCFG2_w_MASK                          0xFFFFFFFF
#define _DEVCFG2_w_LENGTH                        0x00000020

#define _DEVCFG1_FNOSC_POSITION                  0x00000000
#define _DEVCFG1_FNOSC_MASK                      0x00000007
#define _DEVCFG1_FNOSC_LENGTH                    0x00000003

#define _DEVCFG1_FSOSCEN_POSITION                0x00000005
#define _DEVCFG1_FSOSCEN_MASK                    0x00000020
#define _DEVCFG1_FSOSCEN_LENGTH                  0x00000001

#define _DEVCFG1_IESO_POSITION                   0x00000007
#define _DEVCFG1_IESO_MASK                       0x00000080
#define _DEVCFG1_IESO_LENGTH                     0x00000001

#define _DEVCFG1_POSCMOD_POSITION                0x00000008
#define _DEVCFG1_POSCMOD_MASK                    0x00000300
#define _DEVCFG1_POSCMOD_LENGTH                  0x00000002

#define _DEVCFG1_OSCIOFNC_POSITION               0x0000000A
#define _DEVCFG1_OSCIOFNC_MASK                   0x00000400
#define _DEVCFG1_OSCIOFNC_LENGTH                 0x00000001

#define _DEVCFG1_FPBDIV_POSITION                 0x0000000C
#define _DEVCFG1_FPBDIV_MASK                     0x00003000
#define _DEVCFG1_FPBDIV_LENGTH                   0x00000002

